MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA610/mcu.h
#define RPINR7 RPINR7
extern volatile uint16_t RPINR7 __attribute__((__sfr__));
typedef struct tagRPINR7BITS {
  uint16_t IC1R:6;
  uint16_t :2;
  uint16_t IC2R:6;
} RPINR7BITS;
extern volatile RPINR7BITS RPINR7bits __attribute__((__sfr__));

#define RPINR8 RPINR8
extern volatile uint16_t RPINR8 __attribute__((__sfr__));
typedef struct tagRPINR8BITS {
  uint16_t IC3R:6;
} RPINR8BITS;
extern volatile RPINR8BITS RPINR8bits __attribute__((__sfr__));

#define RPINR11 RPINR11
extern volatile uint16_t RPINR11 __attribute__((__sfr__));
typedef struct tagRPINR11BITS {
  uint16_t OCFAR:6;
  uint16_t :2;
  uint16_t OCFBR:6;
} RPINR11BITS;
extern volatile RPINR11BITS RPINR11bits __attribute__((__sfr__));

#define RPINR12 RPINR12
extern volatile uint16_t RPINR12 __attribute__((__sfr__));
typedef struct tagRPINR12BITS {
  uint16_t TCKIAR:6;
  uint16_t :2;
  uint16_t TCKIBR:6;
} RPINR12BITS;
extern volatile RPINR12BITS RPINR12bits __attribute__((__sfr__));

#define RPINR17 RPINR17
extern volatile uint16_t RPINR17 __attribute__((__sfr__));
typedef struct tagRPINR17BITS {
  uint16_t :8;
  uint16_t U3RXR:6;
} RPINR17BITS;
extern volatile RPINR17BITS RPINR17bits __attribute__((__sfr__));

#define RPINR18 RPINR18
extern volatile uint16_t RPINR18 __attribute__((__sfr__));
typedef struct tagRPINR18BITS {
  uint16_t U1RXR:6;
  uint16_t :2;
  uint16_t U1CTSR:6;
} RPINR18BITS;
extern volatile RPINR18BITS RPINR18bits __attribute__((__sfr__));

#define RPINR19 RPINR19
extern volatile uint16_t RPINR19 __attribute__((__sfr__));
typedef struct tagRPINR19BITS {
  uint16_t U2RXR:6;
  uint16_t :2;
  uint16_t U2CTSR:6;
} RPINR19BITS;
extern volatile RPINR19BITS RPINR19bits __attribute__((__sfr__));

#define RPINR20 RPINR20
extern volatile uint16_t RPINR20 __attribute__((__sfr__));
typedef struct tagRPINR20BITS {
  uint16_t SDI1R:6;
  uint16_t :2;
  uint16_t SCK1R:6;
} RPINR20BITS;
extern volatile RPINR20BITS RPINR20bits __attribute__((__sfr__));

#define RPINR21 RPINR21
extern volatile uint16_t RPINR21 __attribute__((__sfr__));
typedef struct tagRPINR21BITS {
  uint16_t SS1R:6;
  uint16_t :2;
  uint16_t U3CTSR:6;
} RPINR21BITS;
extern volatile RPINR21BITS RPINR21bits __attribute__((__sfr__));

#define RPINR22 RPINR22
extern volatile uint16_t RPINR22 __attribute__((__sfr__));
typedef struct tagRPINR22BITS {
  uint16_t SDI2R:6;
  uint16_t :2;
  uint16_t SCK2R:6;
} RPINR22BITS;
extern volatile RPINR22BITS RPINR22bits __attribute__((__sfr__));

#define RPINR23 RPINR23
extern volatile uint16_t RPINR23 __attribute__((__sfr__));
typedef struct tagRPINR23BITS {
  uint16_t SS2R:6;
  uint16_t :2;
  uint16_t TXCKR:6;
} RPINR23BITS;
extern volatile RPINR23BITS RPINR23bits __attribute__((__sfr__));

#define RPINR25 RPINR25
extern volatile uint16_t RPINR25 __attribute__((__sfr__));
typedef struct tagRPINR25BITS {
  uint16_t CLCINAR:6;
  uint16_t :2;
  uint16_t CLCINBR:6;
} RPINR25BITS;
extern volatile RPINR25BITS RPINR25bits __attribute__((__sfr__));

#define RPINR27 RPINR27
extern volatile uint16_t RPINR27 __attribute__((__sfr__));
typedef struct tagRPINR27BITS {
  uint16_t U4RXR:6;
  uint16_t :2;
  uint16_t U4CTSR:6;
} RPINR27BITS;
extern volatile RPINR27BITS RPINR27bits __attribute__((__sfr__));

#define RPINR28 RPINR28
extern volatile uint16_t RPINR28 __attribute__((__sfr__));
typedef struct tagRPINR28BITS {
  uint16_t SDI3R:6;
  uint16_t :2;
  uint16_t SCK3R:6;
} RPINR28BITS;
extern volatile RPINR28BITS RPINR28bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile uint16_t RPINR29 __attribute__((__sfr__));
typedef struct tagRPINR29BITS {
  uint16_t SS3R:6;
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPOR0 RPOR0
extern volatile uint16_t RPOR0 __attribute__((__sfr__));
typedef struct tagRPOR0BITS {
  uint16_t RP0R:7;
  uint16_t :1;
  uint16_t RP1R:7;
} RPOR0BITS;
extern volatile RPOR0BITS RPOR0bits __attribute__((__sfr__));

#define RPOR1 RPOR1
extern volatile uint16_t RPOR1 __attribute__((__sfr__));
typedef struct tagRPOR1BITS {
  uint16_t RP2R:7;
  uint16_t :1;
  uint16_t RP3R:7;
} RPOR1BITS;
extern volatile RPOR1BITS RPOR1bits __attribute__((__sfr__));

#define RPOR2 RPOR2
extern volatile uint16_t RPOR2 __attribute__((__sfr__));
typedef struct tagRPOR2BITS {
  uint16_t RP4R:7;
  uint16_t :1;
  uint16_t RP5R:7;
} RPOR2BITS;
extern volatile RPOR2BITS RPOR2bits __attribute__((__sfr__));

#define RPOR3 RPOR3
extern volatile uint16_t RPOR3 __attribute__((__sfr__));
typedef struct tagRPOR3BITS {
  uint16_t RP6R:7;
  uint16_t :1;
  uint16_t RP7R:7;
} RPOR3BITS;
extern volatile RPOR3BITS RPOR3bits __attribute__((__sfr__));

#define RPOR4 RPOR4
extern volatile uint16_t RPOR4 __attribute__((__sfr__));
typedef struct tagRPOR4BITS {
  uint16_t RP8R:7;
  uint16_t :1;
  uint16_t RP9R:7;
} RPOR4BITS;
extern volatile RPOR4BITS RPOR4bits __attribute__((__sfr__));

#define RPOR5 RPOR5
extern volatile uint16_t RPOR5 __attribute__((__sfr__));
typedef struct tagRPOR5BITS {
  uint16_t RP10R:7;
  uint16_t :1;
  uint16_t RP11R:7;
} RPOR5BITS;
extern volatile RPOR5BITS RPOR5bits __attribute__((__sfr__));

#define RPOR6 RPOR6
extern volatile uint16_t RPOR6 __attribute__((__sfr__));
typedef struct tagRPOR6BITS {
  uint16_t RP12R:7;
  uint16_t :1;
  uint16_t RP13R:7;
} RPOR6BITS;
extern volatile RPOR6BITS RPOR6bits __attribute__((__sfr__));

#define RPOR7 RPOR7
extern volatile uint16_t RPOR7 __attribute__((__sfr__));
typedef struct tagRPOR7BITS {
  uint16_t RP14R:7;
  uint16_t :1;
  uint16_t RP15R:7;
} RPOR7BITS;
extern volatile RPOR7BITS RPOR7bits __attribute__((__sfr__));

#define RPOR8 RPOR8
extern volatile uint16_t RPOR8 __attribute__((__sfr__));
typedef struct tagRPOR8BITS {
  uint16_t RP16R:7;
  uint16_t :1;
  uint16_t RP17R:7;
} RPOR8BITS;
extern volatile RPOR8BITS RPOR8bits __attribute__((__sfr__));

#define RPOR9 RPOR9
extern volatile uint16_t RPOR9 __attribute__((__sfr__));
typedef struct tagRPOR9BITS {
  uint16_t RP18R:7;
  uint16_t :1;
  uint16_t RP19R:7;
} RPOR9BITS;
extern volatile RPOR9BITS RPOR9bits __attribute__((__sfr__));

#define RPOR10 RPOR10
extern volatile uint16_t RPOR10 __attribute__((__sfr__));
typedef struct tagRPOR10BITS {
  uint16_t RP20R:7;
  uint16_t :1;
  uint16_t RP21R:7;
} RPOR10BITS;
extern volatile RPOR10BITS RPOR10bits __attribute__((__sfr__));

#define RPOR11 RPOR11
extern volatile uint16_t RPOR11 __attribute__((__sfr__));
typedef struct tagRPOR11BITS {
  uint16_t RP22R:7;
  uint16_t :1;
  uint16_t RP23R:7;
} RPOR11BITS;
