MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA610/mcu.h
#define _IOCNC_IOCNC2_POSITION                   0x00000002
#define _IOCNC_IOCNC2_MASK                       0x00000004
#define _IOCNC_IOCNC2_LENGTH                     0x00000001

#define _IOCNC_IOCNC3_POSITION                   0x00000003
#define _IOCNC_IOCNC3_MASK                       0x00000008
#define _IOCNC_IOCNC3_LENGTH                     0x00000001

#define _IOCNC_IOCNC4_POSITION                   0x00000004
#define _IOCNC_IOCNC4_MASK                       0x00000010
#define _IOCNC_IOCNC4_LENGTH                     0x00000001

#define _IOCNC_IOCNC12_POSITION                  0x0000000C
#define _IOCNC_IOCNC12_MASK                      0x00001000
#define _IOCNC_IOCNC12_LENGTH                    0x00000001

#define _IOCNC_IOCNC13_POSITION                  0x0000000D
#define _IOCNC_IOCNC13_MASK                      0x00002000
#define _IOCNC_IOCNC13_LENGTH                    0x00000001

#define _IOCNC_IOCNC14_POSITION                  0x0000000E
#define _IOCNC_IOCNC14_MASK                      0x00004000
#define _IOCNC_IOCNC14_LENGTH                    0x00000001

#define _IOCNC_IOCNC15_POSITION                  0x0000000F
#define _IOCNC_IOCNC15_MASK                      0x00008000
#define _IOCNC_IOCNC15_LENGTH                    0x00000001

#define _IOCFC_IOCFC1_POSITION                   0x00000001
#define _IOCFC_IOCFC1_MASK                       0x00000002
#define _IOCFC_IOCFC1_LENGTH                     0x00000001

#define _IOCFC_IOCFC2_POSITION                   0x00000002
#define _IOCFC_IOCFC2_MASK                       0x00000004
#define _IOCFC_IOCFC2_LENGTH                     0x00000001

#define _IOCFC_IOCFC3_POSITION                   0x00000003
#define _IOCFC_IOCFC3_MASK                       0x00000008
#define _IOCFC_IOCFC3_LENGTH                     0x00000001

#define _IOCFC_IOCFC4_POSITION                   0x00000004
#define _IOCFC_IOCFC4_MASK                       0x00000010
#define _IOCFC_IOCFC4_LENGTH                     0x00000001

#define _IOCFC_IOCFC12_POSITION                  0x0000000C
#define _IOCFC_IOCFC12_MASK                      0x00001000
#define _IOCFC_IOCFC12_LENGTH                    0x00000001

#define _IOCFC_IOCFC13_POSITION                  0x0000000D
#define _IOCFC_IOCFC13_MASK                      0x00002000
#define _IOCFC_IOCFC13_LENGTH                    0x00000001

#define _IOCFC_IOCFC14_POSITION                  0x0000000E
#define _IOCFC_IOCFC14_MASK                      0x00004000
#define _IOCFC_IOCFC14_LENGTH                    0x00000001

#define _IOCFC_IOCFC15_POSITION                  0x0000000F
#define _IOCFC_IOCFC15_MASK                      0x00008000
#define _IOCFC_IOCFC15_LENGTH                    0x00000001

#define _CNPUC_IOCPC1_POSITION                   0x00000001
#define _CNPUC_IOCPC1_MASK                       0x00000002
#define _CNPUC_IOCPC1_LENGTH                     0x00000001

#define _CNPUC_IOCPC2_POSITION                   0x00000002
#define _CNPUC_IOCPC2_MASK                       0x00000004
#define _CNPUC_IOCPC2_LENGTH                     0x00000001

#define _CNPUC_IOCPC3_POSITION                   0x00000003
#define _CNPUC_IOCPC3_MASK                       0x00000008
#define _CNPUC_IOCPC3_LENGTH                     0x00000001

#define _CNPUC_IOCPC4_POSITION                   0x00000004
#define _CNPUC_IOCPC4_MASK                       0x00000010
#define _CNPUC_IOCPC4_LENGTH                     0x00000001

#define _CNPUC_IOCPC12_POSITION                  0x0000000C
#define _CNPUC_IOCPC12_MASK                      0x00001000
#define _CNPUC_IOCPC12_LENGTH                    0x00000001

#define _CNPUC_IOCPC13_POSITION                  0x0000000D
#define _CNPUC_IOCPC13_MASK                      0x00002000
#define _CNPUC_IOCPC13_LENGTH                    0x00000001

#define _CNPUC_IOCPC14_POSITION                  0x0000000E
#define _CNPUC_IOCPC14_MASK                      0x00004000
#define _CNPUC_IOCPC14_LENGTH                    0x00000001

#define _CNPUC_IOCPC15_POSITION                  0x0000000F
#define _CNPUC_IOCPC15_MASK                      0x00008000
#define _CNPUC_IOCPC15_LENGTH                    0x00000001

#define _CNPUC_IOCPUC1_POSITION                  0x00000001
#define _CNPUC_IOCPUC1_MASK                      0x00000002
#define _CNPUC_IOCPUC1_LENGTH                    0x00000001

#define _CNPUC_IOCPUC2_POSITION                  0x00000002
#define _CNPUC_IOCPUC2_MASK                      0x00000004
#define _CNPUC_IOCPUC2_LENGTH                    0x00000001

#define _CNPUC_IOCPUC3_POSITION                  0x00000003
#define _CNPUC_IOCPUC3_MASK                      0x00000008
#define _CNPUC_IOCPUC3_LENGTH                    0x00000001

#define _CNPUC_IOCPUC4_POSITION                  0x00000004
#define _CNPUC_IOCPUC4_MASK                      0x00000010
#define _CNPUC_IOCPUC4_LENGTH                    0x00000001

#define _CNPUC_IOCPUC12_POSITION                 0x0000000C
#define _CNPUC_IOCPUC12_MASK                     0x00001000
#define _CNPUC_IOCPUC12_LENGTH                   0x00000001

#define _CNPUC_IOCPUC13_POSITION                 0x0000000D
#define _CNPUC_IOCPUC13_MASK                     0x00002000
#define _CNPUC_IOCPUC13_LENGTH                   0x00000001

#define _CNPUC_IOCPUC14_POSITION                 0x0000000E
#define _CNPUC_IOCPUC14_MASK                     0x00004000
#define _CNPUC_IOCPUC14_LENGTH                   0x00000001

#define _CNPUC_IOCPUC15_POSITION                 0x0000000F
#define _CNPUC_IOCPUC15_MASK                     0x00008000
#define _CNPUC_IOCPUC15_LENGTH                   0x00000001

#define _CNPUC_CNPUC1_POSITION                   0x00000001
#define _CNPUC_CNPUC1_MASK                       0x00000002
#define _CNPUC_CNPUC1_LENGTH                     0x00000001

#define _CNPUC_CNPUC2_POSITION                   0x00000002
#define _CNPUC_CNPUC2_MASK                       0x00000004
#define _CNPUC_CNPUC2_LENGTH                     0x00000001

#define _CNPUC_CNPUC3_POSITION                   0x00000003
#define _CNPUC_CNPUC3_MASK                       0x00000008
#define _CNPUC_CNPUC3_LENGTH                     0x00000001

#define _CNPUC_CNPUC4_POSITION                   0x00000004
#define _CNPUC_CNPUC4_MASK                       0x00000010
#define _CNPUC_CNPUC4_LENGTH                     0x00000001

#define _CNPUC_CNPUC12_POSITION                  0x0000000C
#define _CNPUC_CNPUC12_MASK                      0x00001000
#define _CNPUC_CNPUC12_LENGTH                    0x00000001

#define _CNPUC_CNPUC13_POSITION                  0x0000000D
#define _CNPUC_CNPUC13_MASK                      0x00002000
#define _CNPUC_CNPUC13_LENGTH                    0x00000001

