MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA610/mcu.h
#define _IOCPD_IOCPD12_POSITION                  0x0000000C
#define _IOCPD_IOCPD12_MASK                      0x00001000
#define _IOCPD_IOCPD12_LENGTH                    0x00000001

#define _IOCPD_IOCPD13_POSITION                  0x0000000D
#define _IOCPD_IOCPD13_MASK                      0x00002000
#define _IOCPD_IOCPD13_LENGTH                    0x00000001

#define _IOCPD_IOCPD14_POSITION                  0x0000000E
#define _IOCPD_IOCPD14_MASK                      0x00004000
#define _IOCPD_IOCPD14_LENGTH                    0x00000001

#define _IOCPD_IOCPD15_POSITION                  0x0000000F
#define _IOCPD_IOCPD15_MASK                      0x00008000
#define _IOCPD_IOCPD15_LENGTH                    0x00000001

#define _IOCND_IOCND0_POSITION                   0x00000000
#define _IOCND_IOCND0_MASK                       0x00000001
#define _IOCND_IOCND0_LENGTH                     0x00000001

#define _IOCND_IOCND1_POSITION                   0x00000001
#define _IOCND_IOCND1_MASK                       0x00000002
#define _IOCND_IOCND1_LENGTH                     0x00000001

#define _IOCND_IOCND2_POSITION                   0x00000002
#define _IOCND_IOCND2_MASK                       0x00000004
#define _IOCND_IOCND2_LENGTH                     0x00000001

#define _IOCND_IOCND3_POSITION                   0x00000003
#define _IOCND_IOCND3_MASK                       0x00000008
#define _IOCND_IOCND3_LENGTH                     0x00000001

#define _IOCND_IOCND4_POSITION                   0x00000004
#define _IOCND_IOCND4_MASK                       0x00000010
#define _IOCND_IOCND4_LENGTH                     0x00000001

#define _IOCND_IOCND5_POSITION                   0x00000005
#define _IOCND_IOCND5_MASK                       0x00000020
#define _IOCND_IOCND5_LENGTH                     0x00000001

#define _IOCND_IOCND6_POSITION                   0x00000006
#define _IOCND_IOCND6_MASK                       0x00000040
#define _IOCND_IOCND6_LENGTH                     0x00000001

#define _IOCND_IOCND7_POSITION                   0x00000007
#define _IOCND_IOCND7_MASK                       0x00000080
#define _IOCND_IOCND7_LENGTH                     0x00000001

#define _IOCND_IOCND8_POSITION                   0x00000008
#define _IOCND_IOCND8_MASK                       0x00000100
#define _IOCND_IOCND8_LENGTH                     0x00000001

#define _IOCND_IOCND9_POSITION                   0x00000009
#define _IOCND_IOCND9_MASK                       0x00000200
#define _IOCND_IOCND9_LENGTH                     0x00000001

#define _IOCND_IOCND10_POSITION                  0x0000000A
#define _IOCND_IOCND10_MASK                      0x00000400
#define _IOCND_IOCND10_LENGTH                    0x00000001

#define _IOCND_IOCND11_POSITION                  0x0000000B
#define _IOCND_IOCND11_MASK                      0x00000800
#define _IOCND_IOCND11_LENGTH                    0x00000001

#define _IOCND_IOCND12_POSITION                  0x0000000C
#define _IOCND_IOCND12_MASK                      0x00001000
#define _IOCND_IOCND12_LENGTH                    0x00000001

#define _IOCND_IOCND13_POSITION                  0x0000000D
#define _IOCND_IOCND13_MASK                      0x00002000
#define _IOCND_IOCND13_LENGTH                    0x00000001

#define _IOCND_IOCND14_POSITION                  0x0000000E
#define _IOCND_IOCND14_MASK                      0x00004000
#define _IOCND_IOCND14_LENGTH                    0x00000001

#define _IOCND_IOCND15_POSITION                  0x0000000F
#define _IOCND_IOCND15_MASK                      0x00008000
#define _IOCND_IOCND15_LENGTH                    0x00000001

#define _IOCFD_IOCFD0_POSITION                   0x00000000
#define _IOCFD_IOCFD0_MASK                       0x00000001
#define _IOCFD_IOCFD0_LENGTH                     0x00000001

#define _IOCFD_IOCFD1_POSITION                   0x00000001
#define _IOCFD_IOCFD1_MASK                       0x00000002
#define _IOCFD_IOCFD1_LENGTH                     0x00000001

#define _IOCFD_IOCFD2_POSITION                   0x00000002
#define _IOCFD_IOCFD2_MASK                       0x00000004
#define _IOCFD_IOCFD2_LENGTH                     0x00000001

#define _IOCFD_IOCFD3_POSITION                   0x00000003
#define _IOCFD_IOCFD3_MASK                       0x00000008
#define _IOCFD_IOCFD3_LENGTH                     0x00000001

#define _IOCFD_IOCFD4_POSITION                   0x00000004
#define _IOCFD_IOCFD4_MASK                       0x00000010
#define _IOCFD_IOCFD4_LENGTH                     0x00000001

#define _IOCFD_IOCFD5_POSITION                   0x00000005
#define _IOCFD_IOCFD5_MASK                       0x00000020
#define _IOCFD_IOCFD5_LENGTH                     0x00000001

#define _IOCFD_IOCFD6_POSITION                   0x00000006
#define _IOCFD_IOCFD6_MASK                       0x00000040
#define _IOCFD_IOCFD6_LENGTH                     0x00000001

#define _IOCFD_IOCFD7_POSITION                   0x00000007
#define _IOCFD_IOCFD7_MASK                       0x00000080
#define _IOCFD_IOCFD7_LENGTH                     0x00000001

#define _IOCFD_IOCFD8_POSITION                   0x00000008
#define _IOCFD_IOCFD8_MASK                       0x00000100
#define _IOCFD_IOCFD8_LENGTH                     0x00000001

#define _IOCFD_IOCFD9_POSITION                   0x00000009
#define _IOCFD_IOCFD9_MASK                       0x00000200
#define _IOCFD_IOCFD9_LENGTH                     0x00000001

#define _IOCFD_IOCFD10_POSITION                  0x0000000A
#define _IOCFD_IOCFD10_MASK                      0x00000400
#define _IOCFD_IOCFD10_LENGTH                    0x00000001

#define _IOCFD_IOCFD11_POSITION                  0x0000000B
#define _IOCFD_IOCFD11_MASK                      0x00000800
#define _IOCFD_IOCFD11_LENGTH                    0x00000001

#define _IOCFD_IOCFD12_POSITION                  0x0000000C
#define _IOCFD_IOCFD12_MASK                      0x00001000
#define _IOCFD_IOCFD12_LENGTH                    0x00000001

#define _IOCFD_IOCFD13_POSITION                  0x0000000D
#define _IOCFD_IOCFD13_MASK                      0x00002000
#define _IOCFD_IOCFD13_LENGTH                    0x00000001

