MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA610/mcu.h
#define _IOCPUD_IOCPUD6_POSITION                 0x00000006
#define _IOCPUD_IOCPUD6_MASK                     0x00000040
#define _IOCPUD_IOCPUD6_LENGTH                   0x00000001

#define _IOCPUD_IOCPUD7_POSITION                 0x00000007
#define _IOCPUD_IOCPUD7_MASK                     0x00000080
#define _IOCPUD_IOCPUD7_LENGTH                   0x00000001

#define _IOCPUD_IOCPUD8_POSITION                 0x00000008
#define _IOCPUD_IOCPUD8_MASK                     0x00000100
#define _IOCPUD_IOCPUD8_LENGTH                   0x00000001

#define _IOCPUD_IOCPUD9_POSITION                 0x00000009
#define _IOCPUD_IOCPUD9_MASK                     0x00000200
#define _IOCPUD_IOCPUD9_LENGTH                   0x00000001

#define _IOCPUD_IOCPUD10_POSITION                0x0000000A
#define _IOCPUD_IOCPUD10_MASK                    0x00000400
#define _IOCPUD_IOCPUD10_LENGTH                  0x00000001

#define _IOCPUD_IOCPUD11_POSITION                0x0000000B
#define _IOCPUD_IOCPUD11_MASK                    0x00000800
#define _IOCPUD_IOCPUD11_LENGTH                  0x00000001

#define _IOCPUD_IOCPUD12_POSITION                0x0000000C
#define _IOCPUD_IOCPUD12_MASK                    0x00001000
#define _IOCPUD_IOCPUD12_LENGTH                  0x00000001

#define _IOCPUD_IOCPUD13_POSITION                0x0000000D
#define _IOCPUD_IOCPUD13_MASK                    0x00002000
#define _IOCPUD_IOCPUD13_LENGTH                  0x00000001

#define _IOCPUD_IOCPUD14_POSITION                0x0000000E
#define _IOCPUD_IOCPUD14_MASK                    0x00004000
#define _IOCPUD_IOCPUD14_LENGTH                  0x00000001

#define _IOCPUD_IOCPUD15_POSITION                0x0000000F
#define _IOCPUD_IOCPUD15_MASK                    0x00008000
#define _IOCPUD_IOCPUD15_LENGTH                  0x00000001

#define _IOCPUD_CNPUD0_POSITION                  0x00000000
#define _IOCPUD_CNPUD0_MASK                      0x00000001
#define _IOCPUD_CNPUD0_LENGTH                    0x00000001

#define _IOCPUD_CNPUD1_POSITION                  0x00000001
#define _IOCPUD_CNPUD1_MASK                      0x00000002
#define _IOCPUD_CNPUD1_LENGTH                    0x00000001

#define _IOCPUD_CNPUD2_POSITION                  0x00000002
#define _IOCPUD_CNPUD2_MASK                      0x00000004
#define _IOCPUD_CNPUD2_LENGTH                    0x00000001

#define _IOCPUD_CNPUD3_POSITION                  0x00000003
#define _IOCPUD_CNPUD3_MASK                      0x00000008
#define _IOCPUD_CNPUD3_LENGTH                    0x00000001

#define _IOCPUD_CNPUD4_POSITION                  0x00000004
#define _IOCPUD_CNPUD4_MASK                      0x00000010
#define _IOCPUD_CNPUD4_LENGTH                    0x00000001

#define _IOCPUD_CNPUD5_POSITION                  0x00000005
#define _IOCPUD_CNPUD5_MASK                      0x00000020
#define _IOCPUD_CNPUD5_LENGTH                    0x00000001

#define _IOCPUD_CNPUD6_POSITION                  0x00000006
#define _IOCPUD_CNPUD6_MASK                      0x00000040
#define _IOCPUD_CNPUD6_LENGTH                    0x00000001

#define _IOCPUD_CNPUD7_POSITION                  0x00000007
#define _IOCPUD_CNPUD7_MASK                      0x00000080
#define _IOCPUD_CNPUD7_LENGTH                    0x00000001

#define _IOCPUD_CNPUD8_POSITION                  0x00000008
#define _IOCPUD_CNPUD8_MASK                      0x00000100
#define _IOCPUD_CNPUD8_LENGTH                    0x00000001

#define _IOCPUD_CNPUD9_POSITION                  0x00000009
#define _IOCPUD_CNPUD9_MASK                      0x00000200
#define _IOCPUD_CNPUD9_LENGTH                    0x00000001

#define _IOCPUD_CNPUD10_POSITION                 0x0000000A
#define _IOCPUD_CNPUD10_MASK                     0x00000400
#define _IOCPUD_CNPUD10_LENGTH                   0x00000001

#define _IOCPUD_CNPUD11_POSITION                 0x0000000B
#define _IOCPUD_CNPUD11_MASK                     0x00000800
#define _IOCPUD_CNPUD11_LENGTH                   0x00000001

#define _IOCPUD_CNPUD12_POSITION                 0x0000000C
#define _IOCPUD_CNPUD12_MASK                     0x00001000
#define _IOCPUD_CNPUD12_LENGTH                   0x00000001

#define _IOCPUD_CNPUD13_POSITION                 0x0000000D
#define _IOCPUD_CNPUD13_MASK                     0x00002000
#define _IOCPUD_CNPUD13_LENGTH                   0x00000001

#define _IOCPUD_CNPUD14_POSITION                 0x0000000E
#define _IOCPUD_CNPUD14_MASK                     0x00004000
#define _IOCPUD_CNPUD14_LENGTH                   0x00000001

#define _IOCPUD_CNPUD15_POSITION                 0x0000000F
#define _IOCPUD_CNPUD15_MASK                     0x00008000
#define _IOCPUD_CNPUD15_LENGTH                   0x00000001

#define _CNPDD_IOCPDD0_POSITION                  0x00000000
#define _CNPDD_IOCPDD0_MASK                      0x00000001
#define _CNPDD_IOCPDD0_LENGTH                    0x00000001

#define _CNPDD_IOCPDD1_POSITION                  0x00000001
#define _CNPDD_IOCPDD1_MASK                      0x00000002
#define _CNPDD_IOCPDD1_LENGTH                    0x00000001

#define _CNPDD_IOCPDD2_POSITION                  0x00000002
#define _CNPDD_IOCPDD2_MASK                      0x00000004
#define _CNPDD_IOCPDD2_LENGTH                    0x00000001

#define _CNPDD_IOCPDD3_POSITION                  0x00000003
#define _CNPDD_IOCPDD3_MASK                      0x00000008
#define _CNPDD_IOCPDD3_LENGTH                    0x00000001

#define _CNPDD_IOCPDD4_POSITION                  0x00000004
#define _CNPDD_IOCPDD4_MASK                      0x00000010
#define _CNPDD_IOCPDD4_LENGTH                    0x00000001

#define _CNPDD_IOCPDD5_POSITION                  0x00000005
#define _CNPDD_IOCPDD5_MASK                      0x00000020
#define _CNPDD_IOCPDD5_LENGTH                    0x00000001

#define _CNPDD_IOCPDD6_POSITION                  0x00000006
#define _CNPDD_IOCPDD6_MASK                      0x00000040
#define _CNPDD_IOCPDD6_LENGTH                    0x00000001

#define _CNPDD_IOCPDD7_POSITION                  0x00000007
#define _CNPDD_IOCPDD7_MASK                      0x00000080
#define _CNPDD_IOCPDD7_LENGTH                    0x00000001

#define _CNPDD_IOCPDD8_POSITION                  0x00000008
#define _CNPDD_IOCPDD8_MASK                      0x00000100
#define _CNPDD_IOCPDD8_LENGTH                    0x00000001

#define _CNPDD_IOCPDD9_POSITION                  0x00000009
#define _CNPDD_IOCPDD9_MASK                      0x00000200
#define _CNPDD_IOCPDD9_LENGTH                    0x00000001

