MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ1024GA610/mcu.h
#define _IOCPDF_IOCPDF13_POSITION                0x0000000D
#define _IOCPDF_IOCPDF13_MASK                    0x00002000
#define _IOCPDF_IOCPDF13_LENGTH                  0x00000001

#define _IOCPDF_CNPDF0_POSITION                  0x00000000
#define _IOCPDF_CNPDF0_MASK                      0x00000001
#define _IOCPDF_CNPDF0_LENGTH                    0x00000001

#define _IOCPDF_CNPDF1_POSITION                  0x00000001
#define _IOCPDF_CNPDF1_MASK                      0x00000002
#define _IOCPDF_CNPDF1_LENGTH                    0x00000001

#define _IOCPDF_CNPDF2_POSITION                  0x00000002
#define _IOCPDF_CNPDF2_MASK                      0x00000004
#define _IOCPDF_CNPDF2_LENGTH                    0x00000001

#define _IOCPDF_CNPDF3_POSITION                  0x00000003
#define _IOCPDF_CNPDF3_MASK                      0x00000008
#define _IOCPDF_CNPDF3_LENGTH                    0x00000001

#define _IOCPDF_CNPDF4_POSITION                  0x00000004
#define _IOCPDF_CNPDF4_MASK                      0x00000010
#define _IOCPDF_CNPDF4_LENGTH                    0x00000001

#define _IOCPDF_CNPDF5_POSITION                  0x00000005
#define _IOCPDF_CNPDF5_MASK                      0x00000020
#define _IOCPDF_CNPDF5_LENGTH                    0x00000001

#define _IOCPDF_CNPDF6_POSITION                  0x00000006
#define _IOCPDF_CNPDF6_MASK                      0x00000040
#define _IOCPDF_CNPDF6_LENGTH                    0x00000001

#define _IOCPDF_CNPDF7_POSITION                  0x00000007
#define _IOCPDF_CNPDF7_MASK                      0x00000080
#define _IOCPDF_CNPDF7_LENGTH                    0x00000001

#define _IOCPDF_CNPDF8_POSITION                  0x00000008
#define _IOCPDF_CNPDF8_MASK                      0x00000100
#define _IOCPDF_CNPDF8_LENGTH                    0x00000001

#define _IOCPDF_CNPDF12_POSITION                 0x0000000C
#define _IOCPDF_CNPDF12_MASK                     0x00001000
#define _IOCPDF_CNPDF12_LENGTH                   0x00000001

#define _IOCPDF_CNPDF13_POSITION                 0x0000000D
#define _IOCPDF_CNPDF13_MASK                     0x00002000
#define _IOCPDF_CNPDF13_LENGTH                   0x00000001

#define _TRISG_TRISG0_POSITION                   0x00000000
#define _TRISG_TRISG0_MASK                       0x00000001
#define _TRISG_TRISG0_LENGTH                     0x00000001

#define _TRISG_TRISG1_POSITION                   0x00000001
#define _TRISG_TRISG1_MASK                       0x00000002
#define _TRISG_TRISG1_LENGTH                     0x00000001

#define _TRISG_TRISG2_POSITION                   0x00000002
#define _TRISG_TRISG2_MASK                       0x00000004
#define _TRISG_TRISG2_LENGTH                     0x00000001

#define _TRISG_TRISG3_POSITION                   0x00000003
#define _TRISG_TRISG3_MASK                       0x00000008
#define _TRISG_TRISG3_LENGTH                     0x00000001

#define _TRISG_TRISG6_POSITION                   0x00000006
#define _TRISG_TRISG6_MASK                       0x00000040
#define _TRISG_TRISG6_LENGTH                     0x00000001

#define _TRISG_TRISG7_POSITION                   0x00000007
#define _TRISG_TRISG7_MASK                       0x00000080
#define _TRISG_TRISG7_LENGTH                     0x00000001

#define _TRISG_TRISG8_POSITION                   0x00000008
#define _TRISG_TRISG8_MASK                       0x00000100
#define _TRISG_TRISG8_LENGTH                     0x00000001

#define _TRISG_TRISG9_POSITION                   0x00000009
#define _TRISG_TRISG9_MASK                       0x00000200
#define _TRISG_TRISG9_LENGTH                     0x00000001

#define _TRISG_TRISG12_POSITION                  0x0000000C
#define _TRISG_TRISG12_MASK                      0x00001000
#define _TRISG_TRISG12_LENGTH                    0x00000001

#define _TRISG_TRISG13_POSITION                  0x0000000D
#define _TRISG_TRISG13_MASK                      0x00002000
#define _TRISG_TRISG13_LENGTH                    0x00000001

#define _TRISG_TRISG14_POSITION                  0x0000000E
#define _TRISG_TRISG14_MASK                      0x00004000
#define _TRISG_TRISG14_LENGTH                    0x00000001

#define _TRISG_TRISG15_POSITION                  0x0000000F
#define _TRISG_TRISG15_MASK                      0x00008000
#define _TRISG_TRISG15_LENGTH                    0x00000001

#define _PORTG_RG0_POSITION                      0x00000000
#define _PORTG_RG0_MASK                          0x00000001
#define _PORTG_RG0_LENGTH                        0x00000001

#define _PORTG_RG1_POSITION                      0x00000001
#define _PORTG_RG1_MASK                          0x00000002
#define _PORTG_RG1_LENGTH                        0x00000001

#define _PORTG_RG2_POSITION                      0x00000002
#define _PORTG_RG2_MASK                          0x00000004
#define _PORTG_RG2_LENGTH                        0x00000001

#define _PORTG_RG3_POSITION                      0x00000003
#define _PORTG_RG3_MASK                          0x00000008
#define _PORTG_RG3_LENGTH                        0x00000001

#define _PORTG_RG6_POSITION                      0x00000006
#define _PORTG_RG6_MASK                          0x00000040
#define _PORTG_RG6_LENGTH                        0x00000001

#define _PORTG_RG7_POSITION                      0x00000007
#define _PORTG_RG7_MASK                          0x00000080
#define _PORTG_RG7_LENGTH                        0x00000001

#define _PORTG_RG8_POSITION                      0x00000008
#define _PORTG_RG8_MASK                          0x00000100
#define _PORTG_RG8_LENGTH                        0x00000001

#define _PORTG_RG9_POSITION                      0x00000009
#define _PORTG_RG9_MASK                          0x00000200
#define _PORTG_RG9_LENGTH                        0x00000001

#define _PORTG_RG12_POSITION                     0x0000000C
#define _PORTG_RG12_MASK                         0x00001000
#define _PORTG_RG12_LENGTH                       0x00000001

#define _PORTG_RG13_POSITION                     0x0000000D
#define _PORTG_RG13_MASK                         0x00002000
#define _PORTG_RG13_LENGTH                       0x00000001

